coocox/Mplib/Toshaba/TMPM36x/TMPM363/cmsis_lib/lib/include/tmpm363_cec.h
    typedef enum {
        CEC_BUS_FREE_1_BIT = 0U, /*!< 1 bit cycle */
        CEC_BUS_FREE_2_BIT = 1U, /*!< 2 bit cycle */
        CEC_BUS_FREE_3_BIT = 2U, /*!< 3 bit cycle */
        CEC_BUS_FREE_4_BIT = 3U, /*!< 4 bit cycle */
        CEC_BUS_FREE_5_BIT = 4U, /*!< 5 bit cycle */
        CEC_BUS_FREE_6_BIT = 5U, /*!< 6 bit cycle */
        CEC_BUS_FREE_7_BIT = 6U, /*!< 7 bit cycle */
        CEC_BUS_FREE_8_BIT = 7U, /*!< 8 bit cycle */
        CEC_BUS_FREE_9_BIT = 8U, /*!< 9 bit cycle */
        CEC_BUS_FREE_10_BIT = 9U,        /*!< 10 bit cycle */
        CEC_BUS_FREE_11_BIT = 10U,       /*!< 11 bit cycle */
        CEC_BUS_FREE_12_BIT = 11U,       /*!< 12 bit cycle */
        CEC_BUS_FREE_13_BIT = 12U,       /*!< 13 bit cycle */
        CEC_BUS_FREE_14_BIT = 13U,       /*!< 14 bit cycle */
        CEC_BUS_FREE_15_BIT = 14U,       /*!< 15 bit cycle */
        CEC_BUS_FREE_16_BIT = 15U        /*!< 16 bit cycle */
    } CEC_BusFree;
#define IS_CEC_BUS_FREE(param)    (((param) == CEC_BUS_FREE_1_BIT) || \
                                   ((param) == CEC_BUS_FREE_2_BIT) || \
                                   ((param) == CEC_BUS_FREE_3_BIT) || \
                                   ((param) == CEC_BUS_FREE_4_BIT) || \
                                   ((param) == CEC_BUS_FREE_5_BIT) || \
                                   ((param) == CEC_BUS_FREE_6_BIT) || \
                                   ((param) == CEC_BUS_FREE_7_BIT) || \
                                   ((param) == CEC_BUS_FREE_8_BIT) || \
                                   ((param) == CEC_BUS_FREE_9_BIT) || \
                                   ((param) == CEC_BUS_FREE_10_BIT) || \
                                   ((param) == CEC_BUS_FREE_11_BIT) || \
                                   ((param) == CEC_BUS_FREE_12_BIT) || \
                                   ((param) == CEC_BUS_FREE_13_BIT) || \
                                   ((param) == CEC_BUS_FREE_14_BIT) || \
                                   ((param) == CEC_BUS_FREE_15_BIT) || \
                                   ((param) == CEC_BUS_FREE_16_BIT ))

    typedef enum {
        CEC_CLK_SRC_32KHZ = 0U,          /*!< Low-speed clock 32KHz */
        CEC_CLK_SRC_TBAOUT = 1U          /*!< Timer output from 30kHz to 34KHz */
    } CEC_SrcClk;
#define IS_CEC_CLK_SRC(param)    (((param) == CEC_CLK_SRC_32KHZ) ||\
                                  ((param) == CEC_CLK_SRC_TBAOUT))

    typedef enum {
        CEC_NO_ACK = 0U,
        CEC_ACK = 1U
    } CEC_ACKState;
#define IS_ACK_STATE(param) (((param) == CEC_ACK) || ((param) == CEC_NO_ACK))

    typedef enum {
        CEC_NO_EOM = 0U,
        CEC_EOM = 1U
    } CEC_EOMBit;
#define IS_EOM_BIT(param) (((param) == CEC_EOM) || ((param) == CEC_NO_EOM))

    typedef union {
        uint32_t All;
        struct {
            uint32_t RxEnd:1;
            uint32_t RxStartBit:1;
            uint32_t MAXCycleErr:1;
            uint32_t MINCycleErr:1;
            uint32_t ACKCollision:1;
            uint32_t BufOverrun:1;
            uint32_t WaveformErr:1;
        } Bit;
    } CEC_RxINTState;

    typedef union {
        uint32_t All;
        struct {
            uint32_t TxStart:1;
            uint32_t TxEnd:1;
            uint32_t ArbitrationLost:1;
            uint32_t ACKErr:1;
            uint32_t BufUnderrun:1;
        } Bit;
    } CEC_TxINTState;

    typedef struct {
        uint8_t Data;
        CEC_ACKState ACKBit;
        CEC_EOMBit EOMBit;
    } CEC_DataTypeDef;

    typedef struct {
        uint8_t AddrNumber;
        CEC_LogicalAddr AddrList[16];
    } CEC_AddrListTypeDef;
/** @} */
/* End of group CEC_Exported_types */


/** @defgroup CEC_Exported_FunctionPrototypes
  * @{
  */
    void CEC_Enable(void);
    void CEC_Disable(void);
    void CEC_SWReset(void);
    Result CEC_DefaultConfig(void);
    Result CEC_SetLogicalAddr(CEC_LogicalAddr LogicalAddr);
    Result CEC_AddLogicalAddr(CEC_LogicalAddr LogicalAddr);
    Result CEC_RemoveLogicalAddr(CEC_LogicalAddr LogicalAddr);
    CEC_AddrListTypeDef CEC_GetLogicalAddr(void);
    void CEC_SetRxCtrl(FunctionalState NewState);
    Result CEC_StartTx(void);
    void CEC_StopTx(void);
    CEC_DataTypeDef CEC_GetRxData(void);
    void CEC_SetTxData(uint8_t Data, CEC_EOMBit EOM_Flag);
    FunctionalState CEC_GetRxState(void);
    WorkState CEC_GetTxState(void);
    CEC_RxINTState CEC_GetRxINTState(void);
    CEC_TxINTState CEC_GetTxINTState(void);
    Result CEC_SetACKResponseMode(FunctionalState NewState);
    Result CEC_SetNoiseCancellation(CEC_LowCancellation LowCancellation,
                                    CEC_HighCancellation HighCancellation);
    Result CEC_SetCycleConfig(CEC_CycleMin CycleMin, CEC_CycleMax CycleMax);
    Result CEC_SetDataValidTime(CEC_ValidTime ValidTime);
    Result CEC_SetTimeOutMode(CEC_TimeOut TimeOut);
    Result CEC_SetRxErrINTSuspend(FunctionalState NewState);
    Result CEC_SetSnoopMode(FunctionalState NewState);
    Result CEC_SetRxDetectWaveConfig(CEC_Logical1RisingTimeMin Logical1RisingTimeMin,
                                     CEC_Logical1RisingTimeMax Logical1RisingTimeMax,
                                     CEC_Logical0RisingTimeMin Logical0RisingTimeMin,
                                     CEC_Logical0RisingTimeMax Logical0RisingTimeMax);
    Result CEC_SetRxStartBitWaveConfig(CEC_StartBitRisingTimeMin RisingTimeMin,
                                       CEC_StartBitRisingTimeMax RisingTimeMax,
                                       CEC_StartBitCycleMin CycleMin,
                                       CEC_StartBitCycleMax CycleMax);
    Result CEC_SetRxWaveErrDetect(FunctionalState NewState);
    Result CEC_SetTxWaveConfig(CEC_TxDataBitCycle DataBitCycle,
                               CEC_TxDataBitRisingTime DataBitRisingTime,
                               CEC_TxStartBitCycle StartBitCycle,
                               CEC_TxStartBitRisingTime StartBitRisingTime);
    Result CEC_SetTxBroadcast(FunctionalState NewState);
    Result CEC_SetBusFreeTime(CEC_BusFree BusFree);
    void CEC_SetSrcClk(CEC_SrcClk ClkSrc);
/** @} */
/* End of group CEC_Exported_FunctionPrototypes */

/** @} */
/* End of group CEC */

/** @} */
/* End of group TX03_Periph_Driver */

#endif                          /* defined(__TMPM360_CEC_H) || defined(__TMPM361_CEC_H) || \*/
                                /* defined(__TMPM362_CEC_H) || defined(__TMPM363_CEC_H) || \*/
                                /* defined(__TMPM364_CEC_H) */
#ifdef __cplusplus
}
#endif
#endif /*__TMPM363_CEC_H */

